Revit 2024 API
PipeFittingAndAccessoryData.FluidViscosity Property
 The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double FluidViscosity { get; }
Visual Basic
Public ReadOnly Property FluidViscosity As Double
	Get
Visual C++
public:
property double FluidViscosity {
	double get ();
}
See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace